Tekla Open API Reference for Tekla Structures 2025
BasePoint Constructor (String)
 Initializes a new instance of the BasePoint class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BasePoint(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
The name.
See Also
Reference
BasePoint Class
BasePoint Overload
Tekla.Structures.Model Namespace